In [105]:
# Importando a biblioteca
import pandas as pd

# Extract

In [106]:
# Criando variáveis com o diretório e nome do arquivo
caminho = 'C:\\Users\\rwapa\\Desktop\\Backup\\Dio\\BootCamp - Santander\\Desafio Python ETL\\'
arquivo = 'aumento-salarial.xlsx'

In [107]:
# criando DataFrame e lendo
df = pd.read_excel(caminho + arquivo,sheet_name='Revisão 4')
df

                   Nome  Salário
0       João dos Santos      900
1        Maria da Silva     1200
2     Manoel das Flores     1500
3      Lambarildo Peixe     2000
4       Sebastião Souza     1400
5   Ana Flávia Silveira      990
6  Silvia Helena Santos      854
7       Alberto Roberto     1100

# Transform

In [108]:
# Criando uma lista vazia e atribuindo valores coletados do for
lista = []
for salario in df['Salário']:
    if salario < 1000:
        lista.append(salario + (salario * .20))
    elif salario < 1400:
        lista.append(salario + (salario *.15))
    elif salario >= 1400:
        lista.append(salario + (salario * .10))

lista

[1080.0, 1380.0, 1650.0, 2200.0, 1540.0, 1188.0, 1024.8, 1265.0]

In [109]:
# Criando nova coluna com valores da lista
df['Salário Novo'] = lista
df

                   Nome  Salário  Salário Novo
0       João dos Santos      900        1080.0
1        Maria da Silva     1200        1380.0
2     Manoel das Flores     1500        1650.0
3      Lambarildo Peixe     2000        2200.0
4       Sebastião Souza     1400        1540.0
5   Ana Flávia Silveira      990        1188.0
6  Silvia Helena Santos      854        1024.8
7       Alberto Roberto     1100        1265.0

# Load

In [110]:
# Criando nosso novo arquivo
df.to_excel('Desafio_ETL.xlsx')